Revit 2024 API
View.GetReferenceElevations Method
 Returns element ids of all reference elevations in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ICollection<ElementId> GetReferenceElevations()
Visual Basic
Public Function GetReferenceElevations As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetReferenceElevations()
Return Value
 Element ids of all reference elevations in the view.
See Also
View Class
Autodesk.Revit.DB Namespace